
import json
import os


# Предустановленный справочник

phonebook = {
#    '88049760095': ['СЕМЕНОВ', 'МИХАИЛ', 'МАРКОВИЧ'],
#    '89134449783': ['МАЛЫШЕВА', 'НАДЕЖДА', 'НИКИТИЧНА'],
#    '80161769291': ['ФИЛИППОВ', 'МИХАИЛ', 'АЛЕКСАНДРОВИЧ'],
#    '89118210095': ['МАЛЫШЕВА', 'НАДЕЖДА', 'НИКИТИЧНА']
}
'''
phonebook = {
    '89300193758': ['ДОЛГОБОРОДОВ', 'СЕМЁН', 'ВАЛЕРЬЕВИЧ'],
    '89292385637': ['ОДНОСЕЛЬЦЕВ', 'МАРСЕЛЬ', 'НИКИТОВИЧ'],
    '89337245576': ['ГЕННАДЬЕВА', 'ЯНА', 'АНДРЕЕВНА'],
    '89685316734': ['АПУСЕВ', 'АЛЕКСАНДР', 'РАМИЛЕВИЧ'],
    '89892890665': ['ЗАДОРИН', 'ЯН', 'ГЕОРГИЕВИЧ'],
    '89952030488': ['АЛЕКСЕЕВСКАЯ', 'ЭЛИНА', 'ВАДИМОВНА'],
    '89146433186': ['НЕВЬЯНЦЕВ', 'ОЛЕГ', 'БОРИСОВИЧ'],
    '89672883911': ['ОЛЬШЕВСКАЯ', 'КСЕНИЯ', 'НИКИТОВНА'],
    '89118371097': ['ПОЛУЕХТОВ', 'СТЕПАН', 'ГРИГОРЬЕВИЧ'],
    '89265967126': ['СМИРАНИНА', 'ЕКАТЕРИНА', 'ЭДУАРДОВНА']
}
'''

# Печать строки
def print_row(num):
    print(f'\033[34m', '%-11s' % num, '\033[0m', '%-15s' % phonebook[num][0], '%-15s' % phonebook[num][1], '%-15s' % phonebook[num][2])

# Вывод справочнка на экран
def view():
    print('\n================================================================================')
    for num in phonebook:
        print_row(num)

# Поиск по номеру телефона
def search_num():
    k = 0
    numb = input('\nВведите фрагмент номера: ')
    print('\n================================================================================')
    for num in phonebook:
        if numb in num:
            print_row(num)
            k = 1
    if k == 0:
        print('Нет такого номера')

# Поиск по фамилии
def search_fam():
    k = 0
    fam = input('Введите фрагмент фамилии: ').upper()
    print('\n================================================================================')
    for num in phonebook:
        if fam in phonebook[num][0]:
            print_row(num)
            k = 1
    if k == 0:
        print('Нет такой фамилии')

# Поиск по имени
def search_name():
    k = 0
    name = input('Введите фрагмент имени: ').upper()
    print('\n================================================================================')
    for num in phonebook:
        if name in phonebook[num][1]:
            print_row(num)
            k = 1
    if k == 0:
        print('Нет такого имени')

# Добавление новой записи в справочнк
def app_row():
    ls = []
    num = (input('Введите номер телефона    : '))
    ls.append(input('Введите фамилию владельца : ').upper())
    ls.append(input('Введите имя владельца     : ').upper())
    ls.append(input('Введите отчество владельца: ').upper())
    phonebook[num] = ls
    print('\n================================================================================')
    print_row(num)

# Редактирование записи
def edit_row():
    ls = []
    numdell = (input('Введите номер телефона для редактирования: '))
    print(f'\n№ {numdell}', *phonebook[numdell])
    num = int(input('Введите актуальный номер телефона: '))
    ls.append(input('Введите актуальную фамилию: ').upper())
    ls.append(input('Введите актуальное имя: ').upper())
    ls.append(input('Введите актуальное отчество: ').upper())
    phonebook.pop(numdell)
    phonebook[num] = ls
    print('\n================================================================================')
    print_row(num)

# Удаление записи
def num_dell():
    print('\nНа данный момент в базе хранится, ', len(phonebook),' запсей.')
    view()

    num = input('\nВведите номер телефона для удаления: ')
    if num in phonebook:
        print('\n================================================================================')
        print_row(num)
        tmp = (input('Если удаляем, то нажмте 1, наче любой символ: '))
        print('\nУдаляется запись')
        print('================================================================================')
        print_row(num)
        if tmp == "1":
            phonebook.pop(num)
    else:
        print('Нет такого номера')
    print('\nАктуальное состояние справочника')
    view()

# Запись в файл f = open(file_name, access_mode)
def write_file():
    name_file = input('\nВведите имя файла для сохранения в формате *.json: ')
    with open(name_file, 'w') as f:
        json.dump(phonebook, f)
    print('\nДанные сохранены')
    print(f'\n\033[32m', *os.listdir(), '\033[0m')

def exp_base():
    ex = None
    while ex != '0':
        print('\nЕсли Вы хотите експортироавть всю базу    - введите "\033[34m1\033[0m"'
              '\nЕсли Вы хотите експортироавть одну запись - введите "\033[34m2\033[0m"'
              '\nЕсли Вы решили выйти в главное меню       - введите "\033[31m0\033[0m"')
        ex = (input('\nСделайте Ваш выбор: '))
        os.system('cls')
        if ex == '1':
            write_file()
        elif ex == '2':
            dict_temp = {}
            k = 0
            numb = input('\nВведите фрагмент номера: ')
            print('\n================================================================================')
            for num in phonebook:
                if numb in num:
                    print_row(num)
                    k = 1
            if k == 0:

                print('Нет такого номера')
            if k == 1:
                num = input('\nВведите полностью номер для экспорта: ')
                dict_temp[num] = phonebook[num]
                name_file = input('\nВведите имя файла для сохранения в формате *.json: ')
                with open(name_file, 'w') as f:
                    json.dump(dict_temp, f)
                print('\nДанные сохранены')
                print(f'\n\033[32m', *os.listdir(), '\033[0m')
        elif ex == '0':
            os.system('cls')
            print("\nВы в главном меню")
            pr()
            break
        else:
            print('Неправильный выбор. Повторите ввод')

# Чтение из файла
def read_file():
    global phonebook
    print(f'\n\033[32m', *os.listdir(), '\033[0m')
    name_file = input('\nВведите имя принимаемого файла с расширением из строки выше: ')
    if name_file in os.listdir():
        with open(name_file, 'r') as f:
            phonebook = json.load(f)
        print('\nДанные приняты')
    else:
        print('\nНет такого файла.')

    view()
# Главное меню
def pr():
    print('\nВы используете учебный телефонный справочник.'
      '\nДля работы с телефонным справочником выберите следуещие действия:\n'
      '\nПросмотреть весь справочник      - введите "\033[34m1\033[0m"     |      Редактировать старую запись      - введите "\033[34m6\033[0m"'
      '\nНайти владельца по номеру        - введите "\033[34m2\033[0m"     |      Удаление запси                   - введите "\033[34m7\033[0m"'
      '\nНайти владельца по фамилии       - введите "\033[34m3\033[0m"     |      Запись справочника в файл        - введите "\033[34m8\033[0m"'
      '\nНайти владельца по имени         - введите "\033[34m4\033[0m"     |      Чтение справочника из файла      - введите "\033[34m9\033[0m"'
      '\nВвести новую запись              - введите "\033[34m5\033[0m"     |      Закончить работу со справочником - введите "\033[31m0\033[0m"'
      )
os.system('cls')
pr()
sw = None
while sw != '0':
    sw = (input('\nСделайте Ваш выбор: '))
    os.system('cls')
    pr()
    if sw == '1':
        view()
    elif sw == '2':
        search_num()
    elif sw == '3':
        search_fam()
    elif sw == '5':
        app_row()
    elif sw == '6':
        edit_row()
    elif sw == '4':
        search_name()
    elif sw == '7':
        num_dell()
    elif sw == '8':
        exp_base()
    elif sw == '9':
        read_file()
    elif sw == '0':
        os.system('cls')
        print("\nВсего хорошего!")
        exit()
    else:
        print('Неправильный выбор. Повторите ввод')